server/app/controllers/hosts_controller.rb

  def index
    @hosts = Host.all
---
SELECT * FROM `hosts`

  def show
    @host = Host.find(params[:id])
---
SELECT * FROM `hosts` WHERE (`hosts`.`id` = 1)

  def edit
    @host = Host.find(params[:id])
---
SELECT * FROM `hosts` WHERE (`hosts`.`id` = 1)

  def create
    @host = Host.new(params[:host])

    respond_to do |format|
      if @host.save
---
INSERT INTO `hosts` (`descripcion`, `ubicacion`, `direccion`, `created_at`, `updated_at`) VALUES('San Cris', 'Zona Altos', '192.168.10.1', '2014-09-30 14:44:41', '2014-09-30 14:44:41')

  def update
    @host = Host.find(:first, :conditions => ["nombre = ?", params[:id]])
    respond_to do |format|
      if @host.update_attributes!(params[:host])
---
SELECT * FROM `hosts` WHERE (`hosts`.`nombre` = 'tapachula') LIMIT 1
UPDATE `hosts` SET `nombre` = 'tapachula', `updated_at` = '2014-09-30 15:18:08', `ip` = '187.188.174.78' WHERE `id` = 1